app/views/home/index.html.haml

SELECT "ideas".* FROM "ideas" ORDER BY "ideas"."id" DESC LIMIT 1
SELECT COUNT(*) FROM "tags" JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM "taggings" INNER JOIN ideas ON ideas.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Idea' AND taggings.context = 'tags') AND (taggings.taggable_id IN(SELECT ideas.id FROM "ideas" )) GROUP BY taggings.tag_id HAVING COUNT(taggings.tag_id) > 0) AS taggings ON taggings.tag_id = tags.id
---

    - if Idea.tag_counts.any?
      .hrd