app/controllers/home_controller.rb

SELECT "ideas".* FROM "ideas" ORDER BY id DESC LIMIT 10
---
  def index
    @recent_ideas = Idea.last(10)