app/controllers/ideas_controller.rb

SELECT "users".* FROM "users" ORDER BY email
---
  def new

    @list_users = User.all

SELECT "users".* FROM "users" ORDER BY email
---
  def edit
    @list_users = User.all

SELECT "users".* FROM "users"
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."email" = 'mcordero@devspark.com'
INSERT INTO "ideas" ("content", "created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "asl"], ["created_at", Mon, 26 May 2014 18:34:03 UTC +00:00], ["title", "algo"], ["updated_at", Mon, 26 May 2014 18:34:03 UTC +00:00], ["user_id", 1]]
---
  def create
    @list_users = User.all
    @list_users.delete(current_user)
    @idea = Idea.new(params[:idea])
    @users = User.where(:id => params[:organizing_team])
    @users << current_user
    @users << User.where(:email=>"cbel@devspark.com")
    @idea.users << @users

SELECT "users".* FROM "users"
SELECT "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "ideas" SET "innovation" = 't', "updated_at" = '2014-06-16 17:55:28.686105' WHERE "ideas"."id" = 9
---
  def update
    @list_users = User.all
    @list_users.delete(current_user)

    @idea = Idea.find(params[:id])
    @users = User.where(:id => params[:organizing_team])
    @idea.users << @users
    respond_to do |format|
      if @idea.update_attributes(params[:idea])

DELETE FROM "ideas" WHERE "ideas"."id" = ?  [["id", 1]]
---
  def destroy
    UserMailer.delete_email(@idea).deliver

SELECT "ideas".* FROM "ideas"
---
  def all
    if params[:tag]
      @title = "Ideas tagged by &ldquo;#{params[:tag]}&rdquo;".html_safe
      @ideas = Idea.tagged_with(params[:tag])
    else
      @title = "Ideas"
      @ideas = Idea.all